tests/slopeAvalanche/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

Hz    0.1;  // height of domain
Lx    0.1;  // length of domain
dy    0.01;  // width of domain in empty direction

vertices        
(

    (0 0 0)  // 0
    ($Lx 0 0)  // 1
    ($Lx $dy 0)  // 2
    (0 $dy 0)  // 3

    (0 0 $Hz)  // 4
    ($Lx 0 $Hz)  // 5
    ($Lx $dy $Hz)  // 6
    (0 $dy $Hz)  // 7

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (30 1 20) simpleGrading (1 1 1)
);

edges
(
);

boundary         
(
    sides
    {
        type    patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
        );
    }

    top
    {
        type   patch;
        faces
        (
            (4 5 6 7)
        );
    }
    
    bed
    {
        type    wall;
        faces
        (
            (3 2 1 0)
        );
    }
    
    frontAndBackPlanes
    {
       type     empty;
       faces
       (
           (0 1 5 4)
           (7 6 2 3)
       );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
